scheeles/ep-s20-otbr/s20-otbr/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration

# ESP32-S3 is the host SoC on ESP-Thread-Border-Router board
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y

# Board Settings
CONFIG_ESP_BR_BOARD_DEV_KIT=y
CONFIG_ESP_COEX_EXTERNAL_COEXIST_ENABLE=y
CONFIG_EXTERNAL_COEX_REQUEST_PIN=40
CONFIG_EXTERNAL_COEX_GRANT_PIN=42
CONFIG_EXTERNAL_COEX_PRIORITY_PIN=41
CONFIG_EXTERNAL_COEX_TX_LINE_PIN=45
CONFIG_PIN_TO_RCP_RESET=2
CONFIG_PIN_TO_RCP_BOOT=3
CONFIG_PIN_TO_RCP_TX=8
CONFIG_PIN_TO_RCP_RX=48

# Connections
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_ETHERNET_SPI_DEV0_DM9051=y
CONFIG_ETHERNET_SPI_CLOCK_MHZ=20

# SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ESP System
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=230400
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# IPv6
CONFIG_LWIP_FORCE_ROUTER_FORWARDING=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y

# mbedTLS
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_ECJPAKE_C=y

# OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_RADIO_TREL=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_BR_AUTO_START=y
CONFIG_OPENTHREAD_BR_START_WEB=y
CONFIG_OPENTHREAD_COMM_MAX_JOINER_ENTRIES=50
CONFIG_OPENTHREAD_SRP_CLIENT=n
CONFIG_OPENTHREAD_LINK_METRICS=y
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=2048
CONFIG_OPENTHREAD_MLE_MAX_CHILDREN=32
CONFIG_OPENTHREAD_HEADER_CUSTOM=y
CONFIG_OPENTHREAD_CUSTOM_HEADER_FILE_NAME="openthread-custom-feature.h"
CONFIG_OPENTHREAD_CLI_OTA=y
CONFIG_OPENTHREAD_RCP_COMMAND=y
CONFIG_AUTO_UPDATE_RCP=y

# Logging
# OpenThread's platform logger (otPlatLog) gates each level on the compile-time
# LOG_LOCAL_LEVEL, so DEBUG must be retained in the image for the runtime log-level
# control to be able to reach OT_LOG_LEVEL_DEBG. Nothing extra is printed until the
# level is actually raised.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=200

# Remote logging
# Compiled in but dormant: set the syslog server from the web UI (Network page).
CONFIG_NET_SYSLOG_ENABLED=y

# Versions
CONFIG_SDK_VERSION="v6.0.2"
CONFIG_SDK_URL="https://github.com/espressif/esp-idf.git"
CONFIG_SDK_HASH="7101770dc6db2667b3c477cc31365dd1acd6db4e"

# OTA
CONFIG_CREATE_OTA_IMAGE_WITH_RCP_FW=y
